Revit 2027 API
AlignmentStationLabelSetOptions.HasLeader Property
 Specifies if the label will have a leader. The default value is true.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasLeader { get; set; }
Public Property HasLeader As Boolean
	Get
	Set
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
member HasLeader : bool with get, set
Property Value
Boolean
See Also
Reference
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace